XMLTest/res/raw/enc_stand.xml

<v:Envelope xmlns:v="http://schemas.xmlsoap.org/soap/envelope/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d="http://www.w3.org/2001/XMLSchema" xmlns:c="http://schemas.xmlsoap.org/soap/encoding/"><v:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-1"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=Andreas Schulz,OU=Wert,O=wert,L=Furtwangen,ST=BW,C=BW</ds:X509IssuerName><SerialNumber>2044672965</SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Qa2gflEmjjdJdtM86EN2vNDv8kAgLY1mwqm3w1FIxJy2a5eVsLFrU87/2hAO9GuW3s7XLBwhuRmG
L+8TGsqFlR/5t7JKW5dNmcPlU1uSEUFNprxGlHdx/j+QE1hNIUQJMftvIBcYjg270sqx6ctk/8+/
azTcwy5fqEth8UyxOO2XMv+Y835m4lDzRleMC0iR4EIyPq2gprvjXB4nxKcj0hezcQ+OXktXzaBh
75ZOHfGm8gHAfKzMAo03Nqhk/JjwdofGkdmeqqMcHJUxfYBUr36y3ljxXCCsv/ZVmsT8jLRl1pbb
GE5XkzxNW8FLxwnpoQaU23h1nfFEB/cJqdlf4g==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-1"/></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security><To xmlns="http://www.w3.org/2005/08/addressing">http://192.168.0.102:2000/axis2/services/sample05</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:b6d4f656-5c5d-4b3b-9135-9a06b2312f15</MessageID><Action xmlns="http://www.w3.org/2005/08/addressing">urn:echo</Action></v:Header><v:Body><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-1" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>A7GagbP4Ujlj45aU3JLKeYuzWH4dcG3w8mgX4d8KhegU/zv9bY6ho52VfQ5U9w+qUcprCfEmhjh3
skb3Srp7SBVvRzgoLqsvBrLdNeo7lOGp5GfiWviLyKPW0DnJAF1SqiULYyR2uEX1bkUzT6nPe59M
8y0F1PINgUBwNxdY8Uq9IZtBarXm+zzWmgsZRlqdLttGzWhORpsE4Re93QyNGw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></v:Body></v:Envelope>